TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_dma0.h
/* DMA0_DMATCTL Bits */
/* DMA0_DMATCTL[DMATSEL] Bits */
#define DMA0_DMATCTL_DMATSEL_OFS                 (0)                             /* !< DMATSEL Offset */
#define DMA0_DMATCTL_DMATSEL_MASK                ((uint32_t)0x0000003FU)         /* !< DMA Trigger Select   Note:
                                                                                    Reference the datasheet of the device
                                                                                    to see the specific trigger mapping. */
#define DMA0_DMATCTL_DMATSEL_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define DMA0_DMATCTL_DMATSEL_DMAREQ              ((uint32_t)0x00000000U)         /* !< Software trigger request */
#define DMA0_DMATCTL_DMATSEL_MAXIMUM             ((uint32_t)0x0000003FU)         /* !< Highest possible value */
/* DMA0_DMATCTL[DMATINT] Bits */
#define DMA0_DMATCTL_DMATINT_OFS                 (7)                             /* !< DMATINT Offset */
#define DMA0_DMATCTL_DMATINT_MASK                ((uint32_t)0x00000080U)         /* !< DMA Trigger by Internal Channel */
#define DMA0_DMATCTL_DMATINT_EXTERNAL            ((uint32_t)0x00000000U)         /* !< DMATSEL will define external
                                                                                    trigger select as transfer trigger. */
#define DMA0_DMATCTL_DMATINT_INTERNAL            ((uint32_t)0x00000080U)         /* !< DMATSEL will define internal
                                                                                    channel as transfer trigger select.
                                                                                    0-> Channel0-done, 1-> Channel1-done,
                                                                                    ... */

/* DMA0_GEN_EVENT_IIDX Bits */
/* DMA0_GEN_EVENT_IIDX[STAT] Bits */
#define DMA0_GEN_EVENT_IIDX_STAT_OFS             (0)                             /* !< STAT Offset */
#define DMA0_GEN_EVENT_IIDX_STAT_MASK            ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define DMA0_GEN_EVENT_IIDX_STAT_NO_INTR         ((uint32_t)0x00000000U)         /* !< No bit is set means there is no
                                                                                    pending interrupt request */
#define DMA0_GEN_EVENT_IIDX_STAT_DMACH0          ((uint32_t)0x00000001U)         /* !< DMA Channel 0 size counter reached
                                                                                    zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IIDX_STAT_DMACH1          ((uint32_t)0x00000002U)         /* !< DMA Channel 1 size counter reached
                                                                                    zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IIDX_STAT_DMACH2          ((uint32_t)0x00000003U)         /* !< DMA Channel 2 size counter reached
                                                                                    zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IIDX_STAT_DMACH3          ((uint32_t)0x00000004U)         /* !< DMA Channel 3 size counter reached
                                                                                    zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IIDX_STAT_DMACH4          ((uint32_t)0x00000005U)         /* !< DMA Channel 4 size counter reached
                                                                                    zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IIDX_STAT_DMACH5          ((uint32_t)0x00000006U)         /* !< DMA Channel 5 size counter reached
                                                                                    zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IIDX_STAT_DMACH6          ((uint32_t)0x00000007U)         /* !< DMA Channel 6 size counter reached
                                                                                    zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IIDX_STAT_DMACH7          ((uint32_t)0x00000008U)         /* !< DMA Channel 7 size counter reached
                                                                                    zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IIDX_STAT_DMACH8          ((uint32_t)0x00000009U)         /* !< DMA Channel 8 size counter reached
                                                                                    zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IIDX_STAT_DMACH9          ((uint32_t)0x0000000AU)         /* !< DMA Channel 9 size counter reached
                                                                                    zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IIDX_STAT_DMACH10         ((uint32_t)0x0000000BU)         /* !< DMA Channel 10 size counter reached
                                                                                    zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IIDX_STAT_DMACH11         ((uint32_t)0x0000000CU)         /* !< DMA Channel 11 size counter reached
                                                                                    zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IIDX_STAT_DMACH12         ((uint32_t)0x0000000DU)         /* !< DMA Channel 12 size counter reached
                                                                                    zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IIDX_STAT_DMACH13         ((uint32_t)0x0000000EU)         /* !< DMA Channel 13 size counter reached
                                                                                    zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IIDX_STAT_DMACH14         ((uint32_t)0x0000000FU)         /* !< DMA Channel 14 size counter reached
                                                                                    zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IIDX_STAT_DMACH15         ((uint32_t)0x00000010U)         /* !< DMA Channel 15 size counter reached
                                                                                    zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IIDX_STAT_PREIRQCH0       ((uint32_t)0x00000011U)         /* !< PRE-IRQ event for DMA Channel 0. */
#define DMA0_GEN_EVENT_IIDX_STAT_PREIRQCH1       ((uint32_t)0x00000012U)         /* !< PRE-IRQ event for DMA Channel 1. */
#define DMA0_GEN_EVENT_IIDX_STAT_PREIRQCH2       ((uint32_t)0x00000013U)         /* !< PRE-IRQ event for DMA Channel 2. */
#define DMA0_GEN_EVENT_IIDX_STAT_PREIRQCH3       ((uint32_t)0x00000014U)         /* !< PRE-IRQ event for DMA Channel 3. */
#define DMA0_GEN_EVENT_IIDX_STAT_PREIRQCH4       ((uint32_t)0x00000015U)         /* !< PRE-IRQ event for DMA Channel 4. */
#define DMA0_GEN_EVENT_IIDX_STAT_PREIRQCH5       ((uint32_t)0x00000016U)         /* !< PRE-IRQ event for DMA Channel 5. */
#define DMA0_GEN_EVENT_IIDX_STAT_PREIRQCH6       ((uint32_t)0x00000017U)         /* !< PRE-IRQ event for DMA Channel 6. */
#define DMA0_GEN_EVENT_IIDX_STAT_PREIRQCH7       ((uint32_t)0x00000018U)         /* !< PRE-IRQ event for DMA Channel 7. */
#define DMA0_GEN_EVENT_IIDX_STAT_ADDRERR         ((uint32_t)0x00000019U)         /* !< DMA address error, SRC address not
                                                                                    reachable. */
#define DMA0_GEN_EVENT_IIDX_STAT_DATAERR         ((uint32_t)0x0000001AU)         /* !< DMA data error, SRC data might be
                                                                                    corrupted (PAR or ECC error). */

/* DMA0_GEN_EVENT_IMASK Bits */
/* DMA0_GEN_EVENT_IMASK[DMACH0] Bits */
#define DMA0_GEN_EVENT_IMASK_DMACH0_OFS          (0)                             /* !< DMACH0 Offset */
#define DMA0_GEN_EVENT_IMASK_DMACH0_MASK         ((uint32_t)0x00000001U)         /* !< DMA Channel 0 interrupt signal.
                                                                                    Size counter reached zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IMASK_DMACH0_CLR          ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_GEN_EVENT_IMASK_DMACH0_SET          ((uint32_t)0x00000001U)         /* !< Set interrupt mask bit */
/* DMA0_GEN_EVENT_IMASK[DMACH1] Bits */
#define DMA0_GEN_EVENT_IMASK_DMACH1_OFS          (1)                             /* !< DMACH1 Offset */
#define DMA0_GEN_EVENT_IMASK_DMACH1_MASK         ((uint32_t)0x00000002U)         /* !< DMA Channel 1 interrupt signal.
                                                                                    Size counter reached zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IMASK_DMACH1_CLR          ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_GEN_EVENT_IMASK_DMACH1_SET          ((uint32_t)0x00000002U)         /* !< Set interrupt mask bit */
/* DMA0_GEN_EVENT_IMASK[DMACH2] Bits */
#define DMA0_GEN_EVENT_IMASK_DMACH2_OFS          (2)                             /* !< DMACH2 Offset */
#define DMA0_GEN_EVENT_IMASK_DMACH2_MASK         ((uint32_t)0x00000004U)         /* !< DMA Channel 2 interrupt signal.
                                                                                    Size counter reached zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IMASK_DMACH2_CLR          ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_GEN_EVENT_IMASK_DMACH2_SET          ((uint32_t)0x00000004U)         /* !< Set interrupt mask bit */
/* DMA0_GEN_EVENT_IMASK[DMACH3] Bits */
#define DMA0_GEN_EVENT_IMASK_DMACH3_OFS          (3)                             /* !< DMACH3 Offset */
#define DMA0_GEN_EVENT_IMASK_DMACH3_MASK         ((uint32_t)0x00000008U)         /* !< DMA Channel 3 interrupt signal.
                                                                                    Size counter reached zero (DMASZ=0). */
#define DMA0_GEN_EVENT_IMASK_DMACH3_CLR          ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_GEN_EVENT_IMASK_DMACH3_SET          ((uint32_t)0x00000008U)         /* !< Set interrupt mask bit */
/* DMA0_GEN_EVENT_IMASK[PREIRQCH0] Bits */
#define DMA0_GEN_EVENT_IMASK_PREIRQCH0_OFS       (16)                            /* !< PREIRQCH0 Offset */
#define DMA0_GEN_EVENT_IMASK_PREIRQCH0_MASK      ((uint32_t)0x00010000U)         /* !< Pre-IRQ for Channel 0. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA0_GEN_EVENT_IMASK_PREIRQCH0_CLR       ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_GEN_EVENT_IMASK_PREIRQCH0_SET       ((uint32_t)0x00010000U)         /* !< Set interrupt mask bit */
/* DMA0_GEN_EVENT_IMASK[PREIRQCH1] Bits */
#define DMA0_GEN_EVENT_IMASK_PREIRQCH1_OFS       (17)                            /* !< PREIRQCH1 Offset */
#define DMA0_GEN_EVENT_IMASK_PREIRQCH1_MASK      ((uint32_t)0x00020000U)         /* !< Pre-IRQ for Channel 1. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA0_GEN_EVENT_IMASK_PREIRQCH1_CLR       ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_GEN_EVENT_IMASK_PREIRQCH1_SET       ((uint32_t)0x00020000U)         /* !< Set interrupt mask bit */
/* DMA0_GEN_EVENT_IMASK[ADDRERR] Bits */
#define DMA0_GEN_EVENT_IMASK_ADDRERR_OFS         (24)                            /* !< ADDRERR Offset */
#define DMA0_GEN_EVENT_IMASK_ADDRERR_MASK        ((uint32_t)0x01000000U)         /* !< DMA address error, SRC address not
                                                                                    reachable. */
#define DMA0_GEN_EVENT_IMASK_ADDRERR_CLR         ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_GEN_EVENT_IMASK_ADDRERR_SET         ((uint32_t)0x01000000U)         /* !< Set interrupt mask bit */
/* DMA0_GEN_EVENT_IMASK[DATAERR] Bits */
#define DMA0_GEN_EVENT_IMASK_DATAERR_OFS         (25)                            /* !< DATAERR Offset */
#define DMA0_GEN_EVENT_IMASK_DATAERR_MASK        ((uint32_t)0x02000000U)         /* !< DMA data error, SRC data might be
                                                                                    corrupted (PAR or ECC error). */
#define DMA0_GEN_EVENT_IMASK_DATAERR_CLR         ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_GEN_EVENT_IMASK_DATAERR_SET         ((uint32_t)0x02000000U)         /* !< Set interrupt mask bit */

/* DMA0_GEN_EVENT_RIS Bits */
/* DMA0_GEN_EVENT_RIS[DMACH0] Bits */
#define DMA0_GEN_EVENT_RIS_DMACH0_OFS            (0)                             /* !< DMACH0 Offset */
#define DMA0_GEN_EVENT_RIS_DMACH0_MASK           ((uint32_t)0x00000001U)         /* !< DMA Channel 0 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_GEN_EVENT_RIS_DMACH0_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA0_GEN_EVENT_RIS_DMACH0_SET            ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* DMA0_GEN_EVENT_RIS[DMACH1] Bits */
#define DMA0_GEN_EVENT_RIS_DMACH1_OFS            (1)                             /* !< DMACH1 Offset */
#define DMA0_GEN_EVENT_RIS_DMACH1_MASK           ((uint32_t)0x00000002U)         /* !< DMA Channel 1 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_GEN_EVENT_RIS_DMACH1_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA0_GEN_EVENT_RIS_DMACH1_SET            ((uint32_t)0x00000002U)         /* !< Interrupt occurred */
/* DMA0_GEN_EVENT_RIS[DMACH2] Bits */
#define DMA0_GEN_EVENT_RIS_DMACH2_OFS            (2)                             /* !< DMACH2 Offset */
#define DMA0_GEN_EVENT_RIS_DMACH2_MASK           ((uint32_t)0x00000004U)         /* !< DMA Channel 2 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_GEN_EVENT_RIS_DMACH2_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA0_GEN_EVENT_RIS_DMACH2_SET            ((uint32_t)0x00000004U)         /* !< Interrupt occurred */
/* DMA0_GEN_EVENT_RIS[DMACH3] Bits */
#define DMA0_GEN_EVENT_RIS_DMACH3_OFS            (3)                             /* !< DMACH3 Offset */
#define DMA0_GEN_EVENT_RIS_DMACH3_MASK           ((uint32_t)0x00000008U)         /* !< DMA Channel 3 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_GEN_EVENT_RIS_DMACH3_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA0_GEN_EVENT_RIS_DMACH3_SET            ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* DMA0_GEN_EVENT_RIS[PREIRQCH0] Bits */
#define DMA0_GEN_EVENT_RIS_PREIRQCH0_OFS         (16)                            /* !< PREIRQCH0 Offset */
#define DMA0_GEN_EVENT_RIS_PREIRQCH0_MASK        ((uint32_t)0x00010000U)         /* !< Pre-IRQ for Channel 0. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA0_GEN_EVENT_RIS_PREIRQCH0_CLR         ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_GEN_EVENT_RIS_PREIRQCH0_SET         ((uint32_t)0x00010000U)         /* !< Set interrupt mask bit */
/* DMA0_GEN_EVENT_RIS[PREIRQCH1] Bits */
#define DMA0_GEN_EVENT_RIS_PREIRQCH1_OFS         (17)                            /* !< PREIRQCH1 Offset */
#define DMA0_GEN_EVENT_RIS_PREIRQCH1_MASK        ((uint32_t)0x00020000U)         /* !< Pre-IRQ for Channel 1. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA0_GEN_EVENT_RIS_PREIRQCH1_CLR         ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_GEN_EVENT_RIS_PREIRQCH1_SET         ((uint32_t)0x00020000U)         /* !< Set interrupt mask bit */
/* DMA0_GEN_EVENT_RIS[ADDRERR] Bits */
#define DMA0_GEN_EVENT_RIS_ADDRERR_OFS           (24)                            /* !< ADDRERR Offset */
#define DMA0_GEN_EVENT_RIS_ADDRERR_MASK          ((uint32_t)0x01000000U)         /* !< DMA address error, SRC address not
                                                                                    reachable. */
#define DMA0_GEN_EVENT_RIS_ADDRERR_CLR           ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_GEN_EVENT_RIS_ADDRERR_SET           ((uint32_t)0x01000000U)         /* !< Set interrupt mask bit */
/* DMA0_GEN_EVENT_RIS[DATAERR] Bits */
#define DMA0_GEN_EVENT_RIS_DATAERR_OFS           (25)                            /* !< DATAERR Offset */
#define DMA0_GEN_EVENT_RIS_DATAERR_MASK          ((uint32_t)0x02000000U)         /* !< DMA data error, SRC data might be
                                                                                    corrupted (PAR or ECC error). */
#define DMA0_GEN_EVENT_RIS_DATAERR_CLR           ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_GEN_EVENT_RIS_DATAERR_SET           ((uint32_t)0x02000000U)         /* !< Set interrupt mask bit */

/* DMA0_GEN_EVENT_MIS Bits */
/* DMA0_GEN_EVENT_MIS[DMACH0] Bits */
#define DMA0_GEN_EVENT_MIS_DMACH0_OFS            (0)                             /* !< DMACH0 Offset */
#define DMA0_GEN_EVENT_MIS_DMACH0_MASK           ((uint32_t)0x00000001U)         /* !< DMA Channel 0 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_GEN_EVENT_MIS_DMACH0_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define DMA0_GEN_EVENT_MIS_DMACH0_SET            ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* DMA0_GEN_EVENT_MIS[DMACH1] Bits */
#define DMA0_GEN_EVENT_MIS_DMACH1_OFS            (1)                             /* !< DMACH1 Offset */
#define DMA0_GEN_EVENT_MIS_DMACH1_MASK           ((uint32_t)0x00000002U)         /* !< DMA Channel 1 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_GEN_EVENT_MIS_DMACH1_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define DMA0_GEN_EVENT_MIS_DMACH1_SET            ((uint32_t)0x00000002U)         /* !< Interrupt occurred */
/* DMA0_GEN_EVENT_MIS[DMACH2] Bits */
#define DMA0_GEN_EVENT_MIS_DMACH2_OFS            (2)                             /* !< DMACH2 Offset */
#define DMA0_GEN_EVENT_MIS_DMACH2_MASK           ((uint32_t)0x00000004U)         /* !< DMA Channel 2 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_GEN_EVENT_MIS_DMACH2_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define DMA0_GEN_EVENT_MIS_DMACH2_SET            ((uint32_t)0x00000004U)         /* !< Interrupt occurred */
/* DMA0_GEN_EVENT_MIS[DMACH3] Bits */
#define DMA0_GEN_EVENT_MIS_DMACH3_OFS            (3)                             /* !< DMACH3 Offset */
#define DMA0_GEN_EVENT_MIS_DMACH3_MASK           ((uint32_t)0x00000008U)         /* !< DMA Channel 3 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_GEN_EVENT_MIS_DMACH3_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define DMA0_GEN_EVENT_MIS_DMACH3_SET            ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* DMA0_GEN_EVENT_MIS[PREIRQCH0] Bits */
#define DMA0_GEN_EVENT_MIS_PREIRQCH0_OFS         (16)                            /* !< PREIRQCH0 Offset */
#define DMA0_GEN_EVENT_MIS_PREIRQCH0_MASK        ((uint32_t)0x00010000U)         /* !< Pre-IRQ for Channel 0. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA0_GEN_EVENT_MIS_PREIRQCH0_CLR         ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_GEN_EVENT_MIS_PREIRQCH0_SET         ((uint32_t)0x00010000U)         /* !< Set interrupt mask bit */
/* DMA0_GEN_EVENT_MIS[PREIRQCH1] Bits */
#define DMA0_GEN_EVENT_MIS_PREIRQCH1_OFS         (17)                            /* !< PREIRQCH1 Offset */
#define DMA0_GEN_EVENT_MIS_PREIRQCH1_MASK        ((uint32_t)0x00020000U)         /* !< Pre-IRQ for Channel 1. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA0_GEN_EVENT_MIS_PREIRQCH1_CLR         ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_GEN_EVENT_MIS_PREIRQCH1_SET         ((uint32_t)0x00020000U)         /* !< Set interrupt mask bit */
/* DMA0_GEN_EVENT_MIS[ADDRERR] Bits */
#define DMA0_GEN_EVENT_MIS_ADDRERR_OFS           (24)                            /* !< ADDRERR Offset */
#define DMA0_GEN_EVENT_MIS_ADDRERR_MASK          ((uint32_t)0x01000000U)         /* !< DMA address error, SRC address not
                                                                                    reachable. */
#define DMA0_GEN_EVENT_MIS_ADDRERR_CLR           ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_GEN_EVENT_MIS_ADDRERR_SET           ((uint32_t)0x01000000U)         /* !< Set interrupt mask bit */
/* DMA0_GEN_EVENT_MIS[DATAERR] Bits */
#define DMA0_GEN_EVENT_MIS_DATAERR_OFS           (25)                            /* !< DATAERR Offset */
#define DMA0_GEN_EVENT_MIS_DATAERR_MASK          ((uint32_t)0x02000000U)         /* !< DMA data error, SRC data might be
                                                                                    corrupted (PAR or ECC error). */
#define DMA0_GEN_EVENT_MIS_DATAERR_CLR           ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_GEN_EVENT_MIS_DATAERR_SET           ((uint32_t)0x02000000U)         /* !< Set interrupt mask bit */

