TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_dma0.h
/* DMA0_CPU_INT_IMASK Bits */
/* DMA0_CPU_INT_IMASK[DMACH0] Bits */
#define DMA0_CPU_INT_IMASK_DMACH0_OFS            (0)                             /* !< DMACH0 Offset */
#define DMA0_CPU_INT_IMASK_DMACH0_MASK           ((uint32_t)0x00000001U)         /* !< DMA Channel 0 interrupt signal.
                                                                                    Size counter reached zero (DMASZ=0). */
#define DMA0_CPU_INT_IMASK_DMACH0_CLR            ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_IMASK_DMACH0_SET            ((uint32_t)0x00000001U)         /* !< Set interrupt mask bit */
/* DMA0_CPU_INT_IMASK[DMACH1] Bits */
#define DMA0_CPU_INT_IMASK_DMACH1_OFS            (1)                             /* !< DMACH1 Offset */
#define DMA0_CPU_INT_IMASK_DMACH1_MASK           ((uint32_t)0x00000002U)         /* !< DMA Channel 1 interrupt signal.
                                                                                    Size counter reached zero (DMASZ=0). */
#define DMA0_CPU_INT_IMASK_DMACH1_CLR            ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_IMASK_DMACH1_SET            ((uint32_t)0x00000002U)         /* !< Set interrupt mask bit */
/* DMA0_CPU_INT_IMASK[DMACH2] Bits */
#define DMA0_CPU_INT_IMASK_DMACH2_OFS            (2)                             /* !< DMACH2 Offset */
#define DMA0_CPU_INT_IMASK_DMACH2_MASK           ((uint32_t)0x00000004U)         /* !< DMA Channel 2 interrupt signal.
                                                                                    Size counter reached zero (DMASZ=0). */
#define DMA0_CPU_INT_IMASK_DMACH2_CLR            ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_IMASK_DMACH2_SET            ((uint32_t)0x00000004U)         /* !< Set interrupt mask bit */
/* DMA0_CPU_INT_IMASK[DMACH3] Bits */
#define DMA0_CPU_INT_IMASK_DMACH3_OFS            (3)                             /* !< DMACH3 Offset */
#define DMA0_CPU_INT_IMASK_DMACH3_MASK           ((uint32_t)0x00000008U)         /* !< DMA Channel 3 interrupt signal.
                                                                                    Size counter reached zero (DMASZ=0). */
#define DMA0_CPU_INT_IMASK_DMACH3_CLR            ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_IMASK_DMACH3_SET            ((uint32_t)0x00000008U)         /* !< Set interrupt mask bit */
/* DMA0_CPU_INT_IMASK[PREIRQCH0] Bits */
#define DMA0_CPU_INT_IMASK_PREIRQCH0_OFS         (16)                            /* !< PREIRQCH0 Offset */
#define DMA0_CPU_INT_IMASK_PREIRQCH0_MASK        ((uint32_t)0x00010000U)         /* !< Pre-IRQ for Channel 0. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA0_CPU_INT_IMASK_PREIRQCH0_CLR         ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_IMASK_PREIRQCH0_SET         ((uint32_t)0x00010000U)         /* !< Set interrupt mask bit */
/* DMA0_CPU_INT_IMASK[PREIRQCH1] Bits */
#define DMA0_CPU_INT_IMASK_PREIRQCH1_OFS         (17)                            /* !< PREIRQCH1 Offset */
#define DMA0_CPU_INT_IMASK_PREIRQCH1_MASK        ((uint32_t)0x00020000U)         /* !< Pre-IRQ for Channel 1. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA0_CPU_INT_IMASK_PREIRQCH1_CLR         ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_IMASK_PREIRQCH1_SET         ((uint32_t)0x00020000U)         /* !< Set interrupt mask bit */
/* DMA0_CPU_INT_IMASK[ADDRERR] Bits */
#define DMA0_CPU_INT_IMASK_ADDRERR_OFS           (24)                            /* !< ADDRERR Offset */
#define DMA0_CPU_INT_IMASK_ADDRERR_MASK          ((uint32_t)0x01000000U)         /* !< DMA address error, SRC address not
                                                                                    reachable. */
#define DMA0_CPU_INT_IMASK_ADDRERR_CLR           ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_IMASK_ADDRERR_SET           ((uint32_t)0x01000000U)         /* !< Set interrupt mask bit */
/* DMA0_CPU_INT_IMASK[DATAERR] Bits */
#define DMA0_CPU_INT_IMASK_DATAERR_OFS           (25)                            /* !< DATAERR Offset */
#define DMA0_CPU_INT_IMASK_DATAERR_MASK          ((uint32_t)0x02000000U)         /* !< DMA data error, SRC data might be
                                                                                    corrupted (PAR or ECC error). */
#define DMA0_CPU_INT_IMASK_DATAERR_CLR           ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_IMASK_DATAERR_SET           ((uint32_t)0x02000000U)         /* !< Set interrupt mask bit */

/* DMA0_CPU_INT_RIS Bits */
/* DMA0_CPU_INT_RIS[DMACH0] Bits */
#define DMA0_CPU_INT_RIS_DMACH0_OFS              (0)                             /* !< DMACH0 Offset */
#define DMA0_CPU_INT_RIS_DMACH0_MASK             ((uint32_t)0x00000001U)         /* !< DMA Channel 0 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_CPU_INT_RIS_DMACH0_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA0_CPU_INT_RIS_DMACH0_SET              ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* DMA0_CPU_INT_RIS[DMACH1] Bits */
#define DMA0_CPU_INT_RIS_DMACH1_OFS              (1)                             /* !< DMACH1 Offset */
#define DMA0_CPU_INT_RIS_DMACH1_MASK             ((uint32_t)0x00000002U)         /* !< DMA Channel 1 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_CPU_INT_RIS_DMACH1_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA0_CPU_INT_RIS_DMACH1_SET              ((uint32_t)0x00000002U)         /* !< Interrupt occurred */
/* DMA0_CPU_INT_RIS[DMACH2] Bits */
#define DMA0_CPU_INT_RIS_DMACH2_OFS              (2)                             /* !< DMACH2 Offset */
#define DMA0_CPU_INT_RIS_DMACH2_MASK             ((uint32_t)0x00000004U)         /* !< DMA Channel 2 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_CPU_INT_RIS_DMACH2_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA0_CPU_INT_RIS_DMACH2_SET              ((uint32_t)0x00000004U)         /* !< Interrupt occurred */
/* DMA0_CPU_INT_RIS[DMACH3] Bits */
#define DMA0_CPU_INT_RIS_DMACH3_OFS              (3)                             /* !< DMACH3 Offset */
#define DMA0_CPU_INT_RIS_DMACH3_MASK             ((uint32_t)0x00000008U)         /* !< DMA Channel 3 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_CPU_INT_RIS_DMACH3_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define DMA0_CPU_INT_RIS_DMACH3_SET              ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* DMA0_CPU_INT_RIS[PREIRQCH0] Bits */
#define DMA0_CPU_INT_RIS_PREIRQCH0_OFS           (16)                            /* !< PREIRQCH0 Offset */
#define DMA0_CPU_INT_RIS_PREIRQCH0_MASK          ((uint32_t)0x00010000U)         /* !< Pre-IRQ for Channel 0. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA0_CPU_INT_RIS_PREIRQCH0_CLR           ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_RIS_PREIRQCH0_SET           ((uint32_t)0x00010000U)         /* !< Set interrupt mask bit */
/* DMA0_CPU_INT_RIS[PREIRQCH1] Bits */
#define DMA0_CPU_INT_RIS_PREIRQCH1_OFS           (17)                            /* !< PREIRQCH1 Offset */
#define DMA0_CPU_INT_RIS_PREIRQCH1_MASK          ((uint32_t)0x00020000U)         /* !< Pre-IRQ for Channel 1. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA0_CPU_INT_RIS_PREIRQCH1_CLR           ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_RIS_PREIRQCH1_SET           ((uint32_t)0x00020000U)         /* !< Set interrupt mask bit */
/* DMA0_CPU_INT_RIS[ADDRERR] Bits */
#define DMA0_CPU_INT_RIS_ADDRERR_OFS             (24)                            /* !< ADDRERR Offset */
#define DMA0_CPU_INT_RIS_ADDRERR_MASK            ((uint32_t)0x01000000U)         /* !< DMA address error, SRC address not
                                                                                    reachable. */
#define DMA0_CPU_INT_RIS_ADDRERR_CLR             ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_RIS_ADDRERR_SET             ((uint32_t)0x01000000U)         /* !< Set interrupt mask bit */
/* DMA0_CPU_INT_RIS[DATAERR] Bits */
#define DMA0_CPU_INT_RIS_DATAERR_OFS             (25)                            /* !< DATAERR Offset */
#define DMA0_CPU_INT_RIS_DATAERR_MASK            ((uint32_t)0x02000000U)         /* !< DMA data error, SRC data might be
                                                                                    corrupted (PAR or ECC error). */
#define DMA0_CPU_INT_RIS_DATAERR_CLR             ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_RIS_DATAERR_SET             ((uint32_t)0x02000000U)         /* !< Set interrupt mask bit */

/* DMA0_CPU_INT_MIS Bits */
/* DMA0_CPU_INT_MIS[DMACH0] Bits */
#define DMA0_CPU_INT_MIS_DMACH0_OFS              (0)                             /* !< DMACH0 Offset */
#define DMA0_CPU_INT_MIS_DMACH0_MASK             ((uint32_t)0x00000001U)         /* !< DMA Channel 0 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_CPU_INT_MIS_DMACH0_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define DMA0_CPU_INT_MIS_DMACH0_SET              ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* DMA0_CPU_INT_MIS[DMACH1] Bits */
#define DMA0_CPU_INT_MIS_DMACH1_OFS              (1)                             /* !< DMACH1 Offset */
#define DMA0_CPU_INT_MIS_DMACH1_MASK             ((uint32_t)0x00000002U)         /* !< DMA Channel 1 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_CPU_INT_MIS_DMACH1_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define DMA0_CPU_INT_MIS_DMACH1_SET              ((uint32_t)0x00000002U)         /* !< Interrupt occurred */
/* DMA0_CPU_INT_MIS[DMACH2] Bits */
#define DMA0_CPU_INT_MIS_DMACH2_OFS              (2)                             /* !< DMACH2 Offset */
#define DMA0_CPU_INT_MIS_DMACH2_MASK             ((uint32_t)0x00000004U)         /* !< DMA Channel 2 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_CPU_INT_MIS_DMACH2_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define DMA0_CPU_INT_MIS_DMACH2_SET              ((uint32_t)0x00000004U)         /* !< Interrupt occurred */
/* DMA0_CPU_INT_MIS[DMACH3] Bits */
#define DMA0_CPU_INT_MIS_DMACH3_OFS              (3)                             /* !< DMACH3 Offset */
#define DMA0_CPU_INT_MIS_DMACH3_MASK             ((uint32_t)0x00000008U)         /* !< DMA Channel 3 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_CPU_INT_MIS_DMACH3_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define DMA0_CPU_INT_MIS_DMACH3_SET              ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* DMA0_CPU_INT_MIS[PREIRQCH0] Bits */
#define DMA0_CPU_INT_MIS_PREIRQCH0_OFS           (16)                            /* !< PREIRQCH0 Offset */
#define DMA0_CPU_INT_MIS_PREIRQCH0_MASK          ((uint32_t)0x00010000U)         /* !< Pre-IRQ for Channel 0. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA0_CPU_INT_MIS_PREIRQCH0_CLR           ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_MIS_PREIRQCH0_SET           ((uint32_t)0x00010000U)         /* !< Set interrupt mask bit */
/* DMA0_CPU_INT_MIS[PREIRQCH1] Bits */
#define DMA0_CPU_INT_MIS_PREIRQCH1_OFS           (17)                            /* !< PREIRQCH1 Offset */
#define DMA0_CPU_INT_MIS_PREIRQCH1_MASK          ((uint32_t)0x00020000U)         /* !< Pre-IRQ for Channel 1. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA0_CPU_INT_MIS_PREIRQCH1_CLR           ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_MIS_PREIRQCH1_SET           ((uint32_t)0x00020000U)         /* !< Set interrupt mask bit */
/* DMA0_CPU_INT_MIS[ADDRERR] Bits */
#define DMA0_CPU_INT_MIS_ADDRERR_OFS             (24)                            /* !< ADDRERR Offset */
#define DMA0_CPU_INT_MIS_ADDRERR_MASK            ((uint32_t)0x01000000U)         /* !< DMA address error, SRC address not
                                                                                    reachable. */
#define DMA0_CPU_INT_MIS_ADDRERR_CLR             ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_MIS_ADDRERR_SET             ((uint32_t)0x01000000U)         /* !< Set interrupt mask bit */
/* DMA0_CPU_INT_MIS[DATAERR] Bits */
#define DMA0_CPU_INT_MIS_DATAERR_OFS             (25)                            /* !< DATAERR Offset */
#define DMA0_CPU_INT_MIS_DATAERR_MASK            ((uint32_t)0x02000000U)         /* !< DMA data error, SRC data might be
                                                                                    corrupted (PAR or ECC error). */
#define DMA0_CPU_INT_MIS_DATAERR_CLR             ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_MIS_DATAERR_SET             ((uint32_t)0x02000000U)         /* !< Set interrupt mask bit */

