TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_dma0.h
/* DMA0_CPU_INT_ISET Bits */
/* DMA0_CPU_INT_ISET[DMACH0] Bits */
#define DMA0_CPU_INT_ISET_DMACH0_OFS             (0)                             /* !< DMACH0 Offset */
#define DMA0_CPU_INT_ISET_DMACH0_MASK            ((uint32_t)0x00000001U)         /* !< DMA Channel 0 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_CPU_INT_ISET_DMACH0_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DMA0_CPU_INT_ISET_DMACH0_SET             ((uint32_t)0x00000001U)         /* !< Set interrupt */
/* DMA0_CPU_INT_ISET[DMACH1] Bits */
#define DMA0_CPU_INT_ISET_DMACH1_OFS             (1)                             /* !< DMACH1 Offset */
#define DMA0_CPU_INT_ISET_DMACH1_MASK            ((uint32_t)0x00000002U)         /* !< DMA Channel 1 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_CPU_INT_ISET_DMACH1_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DMA0_CPU_INT_ISET_DMACH1_SET             ((uint32_t)0x00000002U)         /* !< Set interrupt */
/* DMA0_CPU_INT_ISET[DMACH2] Bits */
#define DMA0_CPU_INT_ISET_DMACH2_OFS             (2)                             /* !< DMACH2 Offset */
#define DMA0_CPU_INT_ISET_DMACH2_MASK            ((uint32_t)0x00000004U)         /* !< DMA Channel 2 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_CPU_INT_ISET_DMACH2_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DMA0_CPU_INT_ISET_DMACH2_SET             ((uint32_t)0x00000004U)         /* !< Set interrupt */
/* DMA0_CPU_INT_ISET[DMACH3] Bits */
#define DMA0_CPU_INT_ISET_DMACH3_OFS             (3)                             /* !< DMACH3 Offset */
#define DMA0_CPU_INT_ISET_DMACH3_MASK            ((uint32_t)0x00000008U)         /* !< DMA Channel 3 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_CPU_INT_ISET_DMACH3_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DMA0_CPU_INT_ISET_DMACH3_SET             ((uint32_t)0x00000008U)         /* !< Set interrupt */
/* DMA0_CPU_INT_ISET[PREIRQCH0] Bits */
#define DMA0_CPU_INT_ISET_PREIRQCH0_OFS          (16)                            /* !< PREIRQCH0 Offset */
#define DMA0_CPU_INT_ISET_PREIRQCH0_MASK         ((uint32_t)0x00010000U)         /* !< Pre-IRQ for Channel 0. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA0_CPU_INT_ISET_PREIRQCH0_CLR          ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_ISET_PREIRQCH0_SET          ((uint32_t)0x00010000U)         /* !< Set interrupt mask bit */
/* DMA0_CPU_INT_ISET[PREIRQCH1] Bits */
#define DMA0_CPU_INT_ISET_PREIRQCH1_OFS          (17)                            /* !< PREIRQCH1 Offset */
#define DMA0_CPU_INT_ISET_PREIRQCH1_MASK         ((uint32_t)0x00020000U)         /* !< Pre-IRQ for Channel 1. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA0_CPU_INT_ISET_PREIRQCH1_CLR          ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_ISET_PREIRQCH1_SET          ((uint32_t)0x00020000U)         /* !< Set interrupt mask bit */
/* DMA0_CPU_INT_ISET[ADDRERR] Bits */
#define DMA0_CPU_INT_ISET_ADDRERR_OFS            (24)                            /* !< ADDRERR Offset */
#define DMA0_CPU_INT_ISET_ADDRERR_MASK           ((uint32_t)0x01000000U)         /* !< DMA address error, SRC address not
                                                                                    reachable. */
#define DMA0_CPU_INT_ISET_ADDRERR_CLR            ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_ISET_ADDRERR_SET            ((uint32_t)0x01000000U)         /* !< Set interrupt mask bit */
/* DMA0_CPU_INT_ISET[DATAERR] Bits */
#define DMA0_CPU_INT_ISET_DATAERR_OFS            (25)                            /* !< DATAERR Offset */
#define DMA0_CPU_INT_ISET_DATAERR_MASK           ((uint32_t)0x02000000U)         /* !< DMA data error, SRC data might be
                                                                                    corrupted (PAR or ECC error). */
#define DMA0_CPU_INT_ISET_DATAERR_CLR            ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_ISET_DATAERR_SET            ((uint32_t)0x02000000U)         /* !< Set interrupt mask bit */

/* DMA0_CPU_INT_ICLR Bits */
/* DMA0_CPU_INT_ICLR[DMACH0] Bits */
#define DMA0_CPU_INT_ICLR_DMACH0_OFS             (0)                             /* !< DMACH0 Offset */
#define DMA0_CPU_INT_ICLR_DMACH0_MASK            ((uint32_t)0x00000001U)         /* !< DMA Channel 0 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_CPU_INT_ICLR_DMACH0_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DMA0_CPU_INT_ICLR_DMACH0_CLR             ((uint32_t)0x00000001U)         /* !< Clear interrupt */
/* DMA0_CPU_INT_ICLR[DMACH1] Bits */
#define DMA0_CPU_INT_ICLR_DMACH1_OFS             (1)                             /* !< DMACH1 Offset */
#define DMA0_CPU_INT_ICLR_DMACH1_MASK            ((uint32_t)0x00000002U)         /* !< DMA Channel 1 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_CPU_INT_ICLR_DMACH1_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DMA0_CPU_INT_ICLR_DMACH1_CLR             ((uint32_t)0x00000002U)         /* !< Clear interrupt */
/* DMA0_CPU_INT_ICLR[DMACH2] Bits */
#define DMA0_CPU_INT_ICLR_DMACH2_OFS             (2)                             /* !< DMACH2 Offset */
#define DMA0_CPU_INT_ICLR_DMACH2_MASK            ((uint32_t)0x00000004U)         /* !< DMA Channel 2 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_CPU_INT_ICLR_DMACH2_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DMA0_CPU_INT_ICLR_DMACH2_CLR             ((uint32_t)0x00000004U)         /* !< Clear interrupt */
/* DMA0_CPU_INT_ICLR[DMACH3] Bits */
#define DMA0_CPU_INT_ICLR_DMACH3_OFS             (3)                             /* !< DMACH3 Offset */
#define DMA0_CPU_INT_ICLR_DMACH3_MASK            ((uint32_t)0x00000008U)         /* !< DMA Channel 3 interrupt signals
                                                                                    that size counter reached zero
                                                                                    (DMASZ=0). */
#define DMA0_CPU_INT_ICLR_DMACH3_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DMA0_CPU_INT_ICLR_DMACH3_CLR             ((uint32_t)0x00000008U)         /* !< Clear interrupt */
/* DMA0_CPU_INT_ICLR[PREIRQCH0] Bits */
#define DMA0_CPU_INT_ICLR_PREIRQCH0_OFS          (16)                            /* !< PREIRQCH0 Offset */
#define DMA0_CPU_INT_ICLR_PREIRQCH0_MASK         ((uint32_t)0x00010000U)         /* !< Pre-IRQ for Channel 0. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA0_CPU_INT_ICLR_PREIRQCH0_CLR          ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_ICLR_PREIRQCH0_SET          ((uint32_t)0x00010000U)         /* !< Set interrupt mask bit */
/* DMA0_CPU_INT_ICLR[PREIRQCH1] Bits */
#define DMA0_CPU_INT_ICLR_PREIRQCH1_OFS          (17)                            /* !< PREIRQCH1 Offset */
#define DMA0_CPU_INT_ICLR_PREIRQCH1_MASK         ((uint32_t)0x00020000U)         /* !< Pre-IRQ for Channel 1. Size counter
                                                                                    reached Pre-IRQ threshold. */
#define DMA0_CPU_INT_ICLR_PREIRQCH1_CLR          ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_ICLR_PREIRQCH1_SET          ((uint32_t)0x00020000U)         /* !< Set interrupt mask bit */
/* DMA0_CPU_INT_ICLR[ADDRERR] Bits */
#define DMA0_CPU_INT_ICLR_ADDRERR_OFS            (24)                            /* !< ADDRERR Offset */
#define DMA0_CPU_INT_ICLR_ADDRERR_MASK           ((uint32_t)0x01000000U)         /* !< DMA address error, SRC address not
                                                                                    reachable. */
#define DMA0_CPU_INT_ICLR_ADDRERR_CLR            ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_ICLR_ADDRERR_SET            ((uint32_t)0x01000000U)         /* !< Set interrupt mask bit */
/* DMA0_CPU_INT_ICLR[DATAERR] Bits */
#define DMA0_CPU_INT_ICLR_DATAERR_OFS            (25)                            /* !< DATAERR Offset */
#define DMA0_CPU_INT_ICLR_DATAERR_MASK           ((uint32_t)0x02000000U)         /* !< DMA data error, SRC data might be
                                                                                    corrupted (PAR or ECC error). */
#define DMA0_CPU_INT_ICLR_DATAERR_CLR            ((uint32_t)0x00000000U)         /* !< Clear interrupt mask bit */
#define DMA0_CPU_INT_ICLR_DATAERR_SET            ((uint32_t)0x02000000U)         /* !< Set interrupt mask bit */

