TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_dma0.h
/* DMA0_FSUB_0 Bits */
/* DMA0_FSUB_0[CHANID] Bits */
#define DMA0_FSUB_0_CHANID_OFS                   (0)                             /* !< CHANID Offset */
#define DMA0_FSUB_0_CHANID_MASK                  ((uint32_t)0x000001FFU)         /* !< 0 = disconnected. 1-255 = connected
                                                                                    to channelID = CHANID. */
#define DMA0_FSUB_0_CHANID_MNIMUM                ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define DMA0_FSUB_0_CHANID_UNCONNECTED           ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define DMA0_FSUB_0_CHANID_MAXIMUM               ((uint32_t)0x000000FFU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 255. */

/* DMA0_FSUB_1 Bits */
/* DMA0_FSUB_1[CHANID] Bits */
#define DMA0_FSUB_1_CHANID_OFS                   (0)                             /* !< CHANID Offset */
#define DMA0_FSUB_1_CHANID_MASK                  ((uint32_t)0x000001FFU)         /* !< 0 = disconnected. 1-255 = connected
                                                                                    to channelID = CHANID. */
#define DMA0_FSUB_1_CHANID_MNIMUM                ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define DMA0_FSUB_1_CHANID_UNCONNECTED           ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define DMA0_FSUB_1_CHANID_MAXIMUM               ((uint32_t)0x000000FFU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 255. */

/* DMA0_FPUB_1 Bits */
/* DMA0_FPUB_1[CHANID] Bits */
#define DMA0_FPUB_1_CHANID_OFS                   (0)                             /* !< CHANID Offset */
#define DMA0_FPUB_1_CHANID_MASK                  ((uint32_t)0x000001FFU)         /* !< 0 = disconnected. 1-255 = connected
                                                                                    to channelID = CHANID. */
#define DMA0_FPUB_1_CHANID_MNIMUM                ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define DMA0_FPUB_1_CHANID_UNCONNECTED           ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define DMA0_FPUB_1_CHANID_MAXIMUM               ((uint32_t)0x000000FFU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 255. */

/* DMA0_PDBGCTL Bits */
/* DMA0_PDBGCTL[FREE] Bits */
#define DMA0_PDBGCTL_FREE_OFS                    (0)                             /* !< FREE Offset */
#define DMA0_PDBGCTL_FREE_MASK                   ((uint32_t)0x00000001U)         /* !< Free run control */
#define DMA0_PDBGCTL_FREE_STOP                   ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define DMA0_PDBGCTL_FREE_RUN                    ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */
/* DMA0_PDBGCTL[SOFT] Bits */
#define DMA0_PDBGCTL_SOFT_OFS                    (1)                             /* !< SOFT Offset */
#define DMA0_PDBGCTL_SOFT_MASK                   ((uint32_t)0x00000002U)         /* !< Soft halt boundary control. This
                                                                                    function is only available, if [FREE]
                                                                                    is set to 'STOP' */
#define DMA0_PDBGCTL_SOFT_IMMEDIATE              ((uint32_t)0x00000000U)         /* !< The peripheral will halt
                                                                                    immediately, even if the resultant
                                                                                    state will result in corruption if
                                                                                    the system is restarted */
#define DMA0_PDBGCTL_SOFT_DELAYED                ((uint32_t)0x00000002U)         /* !< The peripheral blocks the debug
                                                                                    freeze until it has reached a
                                                                                    boundary where it can resume without
                                                                                    corruption */

/* DMA0_EVT_MODE Bits */
/* DMA0_EVT_MODE[INT0_CFG] Bits */
#define DMA0_EVT_MODE_INT0_CFG_OFS               (0)                             /* !< INT0_CFG Offset */
#define DMA0_EVT_MODE_INT0_CFG_MASK              ((uint32_t)0x00000003U)         /* !< Event line mode select for event
                                                                                    corresponding to interrupt event
                                                                                    CPU_INT */
#define DMA0_EVT_MODE_INT0_CFG_DISABLE           ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define DMA0_EVT_MODE_INT0_CFG_SOFTWARE          ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define DMA0_EVT_MODE_INT0_CFG_HARDWARE          ((uint32_t)0x00000002U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */
/* DMA0_EVT_MODE[EVT1_CFG] Bits */
#define DMA0_EVT_MODE_EVT1_CFG_OFS               (2)                             /* !< EVT1_CFG Offset */
#define DMA0_EVT_MODE_EVT1_CFG_MASK              ((uint32_t)0x0000000CU)         /* !< Event line mode select for event
                                                                                    corresponding to generic event
                                                                                    GEN_EVENT */
#define DMA0_EVT_MODE_EVT1_CFG_DISABLE           ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define DMA0_EVT_MODE_EVT1_CFG_SOFTWARE          ((uint32_t)0x00000004U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define DMA0_EVT_MODE_EVT1_CFG_HARDWARE          ((uint32_t)0x00000008U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */

/* DMA0_DESC Bits */
/* DMA0_DESC[MINREV] Bits */
#define DMA0_DESC_MINREV_OFS                     (0)                             /* !< MINREV Offset */
#define DMA0_DESC_MINREV_MASK                    ((uint32_t)0x0000000FU)         /* !< Minor rev of the IP */
#define DMA0_DESC_MINREV_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define DMA0_DESC_MINREV_MAXIMUM                 ((uint32_t)0x0000000FU)         /* !< Highest possible value */
/* DMA0_DESC[MAJREV] Bits */
#define DMA0_DESC_MAJREV_OFS                     (4)                             /* !< MAJREV Offset */
#define DMA0_DESC_MAJREV_MASK                    ((uint32_t)0x000000F0U)         /* !< Major rev of the IP */
#define DMA0_DESC_MAJREV_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define DMA0_DESC_MAJREV_MAXIMUM                 ((uint32_t)0x000000F0U)         /* !< Highest possible value */
/* DMA0_DESC[FEATUREVER] Bits */
#define DMA0_DESC_FEATUREVER_OFS                 (12)                            /* !< FEATUREVER Offset */
#define DMA0_DESC_FEATUREVER_MASK                ((uint32_t)0x0000F000U)         /* !< Feature Set for the DMA: number of
                                                                                    DMA channel minus one  (e.g. 0->1ch,
                                                                                    2->3ch, 15->16ch). */
#define DMA0_DESC_FEATUREVER_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value (1 channel) */
#define DMA0_DESC_FEATUREVER_MAXIMUM             ((uint32_t)0x0000F000U)         /* !< Highest value (16 channel) */
/* DMA0_DESC[MODULEID] Bits */
#define DMA0_DESC_MODULEID_OFS                   (16)                            /* !< MODULEID Offset */
#define DMA0_DESC_MODULEID_MASK                  ((uint32_t)0xFFFF0000U)         /* !< Module identification contains a
                                                                                    unique peripheral identification
                                                                                    number. The assignments are
                                                                                    maintained in a central database for
                                                                                    all of the platform modules to ensure
                                                                                    uniqueness. */
#define DMA0_DESC_MODULEID_MINIMUM               ((uint32_t)0x00000000U)         /* !< Smallest value */
#define DMA0_DESC_MODULEID_MAXIMUM               ((uint32_t)0xFFFF0000U)         /* !< Highest possible value */

