TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_dma0.h
/* DMA0_DMAPRIO Bits */
/* DMA0_DMAPRIO[ROUNDROBIN] Bits */
#define DMA0_DMAPRIO_ROUNDROBIN_OFS              (0)                             /* !< ROUNDROBIN Offset */
#define DMA0_DMAPRIO_ROUNDROBIN_MASK             ((uint32_t)0x00000001U)         /* !< Round robin. This bit enables the
                                                                                    round-robin DMA channel priorities. */
#define DMA0_DMAPRIO_ROUNDROBIN_DISABLE          ((uint32_t)0x00000000U)         /* !< Roundrobin priority disabled, DMA
                                                                                    channel priority is fixed:
                                                                                    DMA0-DMA1-DMA2-...-DMA16 */
#define DMA0_DMAPRIO_ROUNDROBIN_ENABLE           ((uint32_t)0x00000001U)         /* !< Roundrobin priority enabled, DMA
                                                                                    channel priority changes with each
                                                                                    transfer */
/* DMA0_DMAPRIO[BURSTSZ] Bits */
#define DMA0_DMAPRIO_BURSTSZ_OFS                 (16)                            /* !< BURSTSZ Offset */
#define DMA0_DMAPRIO_BURSTSZ_MASK                ((uint32_t)0x00030000U)         /* !< Define the burst size of a block
                                                                                    transfer, before the priority is
                                                                                    re-evaluated */
#define DMA0_DMAPRIO_BURSTSZ_INFINITI            ((uint32_t)0x00000000U)         /* !< There is no burst size, the whole
                                                                                    block transfer is completed on one
                                                                                    transfer without interruption */
#define DMA0_DMAPRIO_BURSTSZ_BURST_8             ((uint32_t)0x00010000U)         /* !< The burst size is 8, after 9
                                                                                    transfers the block transfer is
                                                                                    interrupted and the priority is
                                                                                    reevaluated */
#define DMA0_DMAPRIO_BURSTSZ_BUSRT_16            ((uint32_t)0x00020000U)         /* !< The burst size is 16, after 17
                                                                                    transfers the block transfer is
                                                                                    interrupted and the priority is
                                                                                    reevaluated */
#define DMA0_DMAPRIO_BURSTSZ_BURST_32            ((uint32_t)0x00030000U)         /* !< The burst size is 32, after 33
                                                                                    transfers the block transfer is
                                                                                    interrupted and the priority is
                                                                                    reevaluated */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_dma0__include */

